name: "MSCNN"
layer {
  top: "data"
  top: "label_1_5x5"
  top: "label_1_7x7"
  top: "label_2_5x5"
  top: "label_2_7x7"
  top: "label_3_5x5"
  top: "label_3_7x7"
  top: "label_4_5x5"
  name: "data"
  type: "ImageGtData"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mean_value: 0
    
  }
  image_gt_data_param {
    source: "../../../data/night_det/window_files/train_subclass.txt"
    batch_size: 4
    coord_num: 4
    resize_width: 1344
    resize_height: 768
    crop_width: 768
    crop_height: 768
    min_gt_height: 25
    downsample_rate: 8
    downsample_rate: 8
    downsample_rate: 16
    downsample_rate: 16
    downsample_rate: 32
    downsample_rate: 32
    downsample_rate: 64
    field_w: 52
    field_w: 94
    field_w: 143
    field_w: 205
    field_w: 282
    field_w: 374
    field_w: 539
    field_h: 46
    field_h: 84
    field_h: 128
    field_h: 190
    field_h: 266
    field_h: 366
    field_h: 582
    fg_threshold: 0.5
    do_multiple_scale: true
    min_scale: 46
    max_scale: 582
    shuffle: true
  }
}
layer {
  top: "data"
  top: "label_1_5x5"
  top: "label_1_7x7"
  top: "label_2_5x5"
  top: "label_2_7x7"
  top: "label_3_5x5"
  top: "label_3_7x7"
  top: "label_4_5x5"
  name: "data"
  type: "ImageGtData"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mean_value: 0
  }
  image_gt_data_param {
    source: "../../../data/night_det/window_files/train_subclass.txt"
    batch_size: 2
    coord_num: 4
    resize_width: 1344
    resize_height: 768
    crop_width: 768
    crop_height: 768
    min_gt_height: 35
    downsample_rate: 8
    downsample_rate: 8
    downsample_rate: 16
    downsample_rate: 16
    downsample_rate: 32
    downsample_rate: 32
    downsample_rate: 64
    field_w: 52
    field_w: 94
    field_w: 143
    field_w: 205
    field_w: 282
    field_w: 374
    field_w: 539
    field_h: 46
    field_h: 84
    field_h: 128
    field_h: 190
    field_h: 266
    field_h: 366
    field_h: 582
    fg_threshold: 0.5
    do_multiple_scale: false
    shuffle: true
  }
}
layer {
  name: "slice"
  type: "Slice"
  bottom: "data"
  top: "data123"
  top: "ch4"
  slice_param {
    axis: 1
    slice_point: 3
  }
}
layer {
    name: "ch4_0-127"
    bottom: "ch4"
    top: "ch4_0-127"
    type: "Power"
    power_param {
      power: 1
      scale: 1
      shift: -128
    }
  }
layer {
    name: "ch4_128-255"
    bottom: "ch4"
    top: "ch4_128-255"
    type: "Power"
    power_param {
      power: 1
      scale: -1
      shift: 128
    }
  }
layer {
  name: "ch4_2cls-concat"
  type: "Concat"
  bottom: "ch4_0-127"
  bottom: "ch4_128-255"
  top: "ch4_2cls"
}
layer {
  name: "relu_ch42cls"
  type: "ReLU"
  bottom: "ch4_2cls"
  top: "ch4_2cls"
}
layer {
  bottom: "data123"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    
  }
}
layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "relu1_1"
  type: "ReLU"
}
layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "ch4_2cls"
  top: "ch4_pool1"
  name: "ch4_pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool1_concat"
  type: "Concat"
  bottom: "pool1"
  bottom: "ch4_pool1"
  top: "pool1_new"
}
layer {
  bottom: "pool1_new"
  top: "conv2_1"
  name: "conv2_1_new"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "ch4_pool1"
  top: "ch4_pool2"
  name: "ch4_pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool2_concat"
  type: "Concat"
  bottom: "pool2"
  bottom: "ch4_pool2"
  top: "pool2_new"
}
layer {
  bottom: "pool2_new"
  top: "conv3_1"
  name: "conv3_1_new"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "relu3_1"
  type: "ReLU"
}
layer {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "relu3_2"
  type: "ReLU"
}
layer {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "relu3_3"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "pool3"
  name: "pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "ch4_pool2"
  top: "ch4_pool3"
  name: "ch4_pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool3_concat"
  type: "Concat"
  bottom: "pool3"
  bottom: "ch4_pool3"
  top: "pool3_new"
}
layer {
  bottom: "pool3_new"
  top: "conv4_1"
  name: "conv4_1_new"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "relu4_1"
  type: "ReLU"
}
layer {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "relu4_2"
  type: "ReLU"
}
layer {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "relu4_3"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "loss1_conv1"
  name: "loss1_conv1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "loss1_conv1"
  top: "loss1_conv1"
  name: "loss_relu1"
  type: "ReLU"
}
layer {
  bottom: "loss1_conv1"
  top: "LFCN_1_5x5_sub"
  name: "LFCN_1_5x5_sub"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_1_5x5_sub"
  bottom: "label_1_5x5"
  top: "loss_1_5x5"
  name: "detection_loss_1_5x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 0.05
    field_h: 46
    field_w: 52
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
  loss_weight: 0.9
}
layer {
  bottom: "LFCN_1_5x5_sub"
  bottom: "label_1_5x5"
  top: "accuracy_1_5x5"
  top: "boxiou_1_5x5"
  name: "detection_accuracy_1_5x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 46
    field_w: 52
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
  }
}
layer {
  bottom: "loss1_conv1"
  top: "LFCN_1_7x7_sub"
  name: "LFCN_1_7x7_sub"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_1_7x7_sub"
  bottom: "label_1_7x7"
  top: "loss_1_7x7"
  name: "detection_loss_1_7x7"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 0.05
    field_h: 84
    field_w: 94
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
  loss_weight: 0.9
}
layer {
  bottom: "LFCN_1_7x7_sub"
  bottom: "label_1_7x7"
  top: "accuracy_1_7x7"
  top: "boxiou_1_7x7"
  name: "detection_accuracy_1_7x7"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 84
    field_w: 94
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
  }
}
layer {
  bottom: "conv4_3"
  top: "pool4"
  name: "pool4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "relu5_1"
  type: "ReLU"
}
layer {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "relu5_2"
  type: "ReLU"
}
layer {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "relu5_3"
  type: "ReLU"
}
layer {
  bottom: "conv5_3"
  top: "LFCN_2_5x5_sub"
  name: "LFCN_2_5x5_sub"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_2_5x5_sub"
  bottom: "label_2_5x5"
  top: "loss_2_5x5"
  name: "detection_loss_2_5x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 0.05
    field_h: 128
    field_w: 143
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_2_5x5_sub"
  bottom: "label_2_5x5"
  top: "accuracy_2_5x5"
  top: "boxiou_2_5x5"
  name: "detection_accuracy_2_5x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 128
    field_w: 143
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
  }
}
layer {
  bottom: "conv5_3"
  top: "LFCN_2_7x7_sub"
  name: "LFCN_2_7x7_sub"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_2_7x7_sub"
  bottom: "label_2_7x7"
  top: "loss_2_7x7"
  name: "detection_loss_2_7x7"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 0.05
    field_h: 190
    field_w: 205
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_2_7x7_sub"
  bottom: "label_2_7x7"
  top: "accuracy_2_7x7"
  top: "boxiou_2_7x7"
  name: "detection_accuracy_2_7x7"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 190
    field_w: 205
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
  }
}
layer {
  bottom: "conv5_3"
  top: "pool5"
  name: "pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool5"
  top: "conv6_1"
  name: "conv6_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }

}
layer {
  bottom: "conv6_1"
  top: "conv6_1"
  name: "relu6_1"
  type: "ReLU"
}
layer {
  bottom: "conv6_1"
  top: "LFCN_3_5x5_sub"
  name: "LFCN_3_5x5_sub"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_3_5x5_sub"
  bottom: "label_3_5x5"
  top: "loss_3_5x5"
  name: "detection_loss_3_5x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 0.05
    field_h: 266
    field_w: 282
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_3_5x5_sub"
  bottom: "label_3_5x5"
  top: "accuracy_3_5x5"
  top: "boxiou_3_5x5"
  name: "detection_accuracy_3_5x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 266
    field_w: 282
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
  }
}
layer {
  bottom: "conv6_1"
  top: "LFCN_3_7x7_sub"
  name: "LFCN_3_7x7_sub"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_3_7x7_sub"
  bottom: "label_3_7x7"
  top: "loss_3_7x7"
  name: "detection_loss_3_7x7"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 0.05
    field_h: 366
    field_w: 374
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_3_7x7_sub"
  bottom: "label_3_7x7"
  top: "accuracy_3_7x7"
  top: "boxiou_3_7x7"
  name: "detection_accuracy_3_7x7"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 366
    field_w: 374
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
  }
}
layer {
  bottom: "conv6_1"
  top: "pool6"
  name: "pool6"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool6"
  top: "LFCN_4_5x5_sub"
  name: "LFCN_4_5x5_sub"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_4_5x5_sub"
  bottom: "label_4_5x5"
  top: "loss_4_5x5"
  name: "detection_loss_4_5x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 0.05
    field_h: 582
    field_w: 539
    field_whr: 2
    field_xyr: 2
    downsample_rate: 64
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_4_5x5_sub"
  bottom: "label_4_5x5"
  top: "accuracy_4_5x5"
  top: "boxiou_4_5x5"
  name: "detection_accuracy_4_5x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 582
    field_w: 539 
    field_whr: 2
    field_xyr: 2
    downsample_rate: 64
  }
}
